test/fixture/paos/DIDAuthenticateEACAdditionalInput_template.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paos="urn:liberty:paos:2006-08" xmlns:wsa="http://www.w3.org/2005/03/addressing" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <S:Header>
    <paos:PAOS S:actor="http://schemas.xmlsoap.org/soap/actor/next" S:mustUnderstand="1">
      <paos:Version>urn:liberty:2006-08</paos:Version>
      <paos:EndpointReference>
        <paos:Address>http://www.projectliberty.org/2006/01/role/paos</paos:Address>
      </paos:EndpointReference>
    </paos:PAOS>
    <wsa:MessageID>urn:uuid:922a6cfd-1cea-4757-b69e-cac833a9de5c</wsa:MessageID>
    <wsa:Action>http://www.bsi.bund.de/ecard/api/1.0/PAOS/GetNextCommand</wsa:Action>
  </S:Header>
  <S:Body>
    <ns3:DIDAuthenticate xmlns="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:iso:std:iso-iec:24727:tech:schema" xmlns:ns4="http://www.w3.org/2001/04/xmldsig-more#" xmlns:ns5="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:ns6="urn:oasis:names:tc:SAML:1.0:protocol">
      <!-- CONNECTIONHANDLE -->
      <!-- DIDNAME -->
      <ns3:AuthenticationProtocolData Protocol="urn:oid:1.3.162.15480.3.0.14" xsi:type="ns3:EACAdditionalInputType">
        <!-- SIGNATURE -->
      </ns3:AuthenticationProtocolData>
    </ns3:DIDAuthenticate>
  </S:Body>
</S:Envelope>
